"""
Створення віртуального оточення
Щоб створити нове віртуальне оточення, виконайте наступні кроки:

Відкрийте термінал або командний рядок.
Перейдіть до директорії, де ви хочете створити свій Python проєкт.
Виконайте наступну команду для створення віртуального оточення:
python -m venv .venv 


Щоб почати використовувати Python з віртуального оточення, виконайте активацію віртуального оточення. 
На Windows у командному рядку (CMD): .\.venv\Scripts\activate.bat
На Windows у PowerShell: .\.venv\Scripts\Activate.ps1
На macOS та Linux: source .venv/bin/activate


Щоб встановити необхідні бібліотеки в межах цього віртуального оточення, використовуйте pip install:
pip install package_name


Щоб повернутися до системного Python, виконайте в консолі:
deactivate


Ви можете автоматично згенерувати requirements.txt за допомогою pip. Для цього просто запустіть наступну команду у вашому віртуальному середовищі:
pip freeze > requirements.txt


Щоб встановити пакети, перелічені у requirements.txt, використовуйте команду:
pip install -r requirements.txt

"""
